{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "Encoder-Input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "name": "Encoder-Input"}, "inbound_nodes": []}, {"name": "Encoder-Token-Embedding", "class_name": "EmbeddingRet", "config": {"name": "Encoder-Token-Embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 29, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "inbound_nodes": [[["Encoder-Input", 0, 0, {}]]]}, {"name": "Encoder-Embedding", "class_name": "TrigPosEmbedding", "config": {"name": "Encoder-Embedding", "trainable": true, "dtype": "float32", "mode": "add", "output_dim": null}, "inbound_nodes": [[["Encoder-Token-Embedding", 0, 0, {}]]]}, {"name": "Encoder-1-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Encoder-1-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "inbound_nodes": [[["Encoder-Embedding", 0, 0, {}]]]}, {"name": "Encoder-1-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Encoder-1-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Encoder-1-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Encoder-1-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Encoder-1-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Encoder-Embedding", 0, 0, {}], ["Encoder-1-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Encoder-1-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Encoder-1-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "inbound_nodes": [[["Encoder-1-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Encoder-1-FeedForward", "class_name": "FeedForward", "config": {"name": "Encoder-1-FeedForward", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "inbound_nodes": [[["Encoder-1-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"name": "Encoder-1-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Encoder-1-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Encoder-1-FeedForward", 0, 0, {}]]]}, {"name": "Encoder-1-FeedForward-Add", "class_name": "Add", "config": {"name": "Encoder-1-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Encoder-1-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-1-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Encoder-1-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Encoder-1-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "inbound_nodes": [[["Encoder-1-FeedForward-Add", 0, 0, {}]]]}, {"name": "Encoder-2-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Encoder-2-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "inbound_nodes": [[["Encoder-1-FeedForward-Norm", 0, 0, {}]]]}, {"name": "Decoder-Input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "name": "Decoder-Input"}, "inbound_nodes": []}, {"name": "Encoder-2-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Encoder-2-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Encoder-2-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Decoder-Token-Embedding", "class_name": "EmbeddingRet", "config": {"name": "Decoder-Token-Embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 29, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "inbound_nodes": [[["Decoder-Input", 0, 0, {}]]]}, {"name": "Encoder-2-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Encoder-2-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Encoder-1-FeedForward-Norm", 0, 0, {}], ["Encoder-2-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Decoder-Embedding", "class_name": "TrigPosEmbedding", "config": {"name": "Decoder-Embedding", "trainable": true, "dtype": "float32", "mode": "add", "output_dim": null}, "inbound_nodes": [[["Decoder-Token-Embedding", 0, 0, {}]]]}, {"name": "Encoder-2-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Encoder-2-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "inbound_nodes": [[["Encoder-2-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Decoder-1-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Decoder-1-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": true}, "inbound_nodes": [[["Decoder-Embedding", 0, 0, {}]]]}, {"name": "Encoder-2-FeedForward", "class_name": "FeedForward", "config": {"name": "Encoder-2-FeedForward", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "inbound_nodes": [[["Encoder-2-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"name": "Decoder-1-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Decoder-1-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Decoder-1-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Encoder-2-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Encoder-2-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Encoder-2-FeedForward", 0, 0, {}]]]}, {"name": "Decoder-1-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Decoder-1-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Decoder-Embedding", 0, 0, {}], ["Decoder-1-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Encoder-2-FeedForward-Add", "class_name": "Add", "config": {"name": "Encoder-2-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Encoder-2-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-2-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Decoder-1-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Decoder-1-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "inbound_nodes": [[["Decoder-1-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Encoder-2-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Encoder-2-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "inbound_nodes": [[["Encoder-2-FeedForward-Add", 0, 0, {}]]]}, {"name": "Decoder-1-MultiHeadQueryAttention", "class_name": "MultiHeadAttention", "config": {"name": "Decoder-1-MultiHeadQueryAttention", "trainable": true, "dtype": "float32", "head_num": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "inbound_nodes": [[["Decoder-1-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-2-FeedForward-Norm", 0, 0, {}], ["Encoder-2-FeedForward-Norm", 0, 0, {}]]]}, {"name": "Decoder-1-MultiHeadQueryAttention-Dropout", "class_name": "Dropout", "config": {"name": "Decoder-1-MultiHeadQueryAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Decoder-1-MultiHeadQueryAttention", 0, 0, {}]]]}, {"name": "Decoder-1-MultiHeadQueryAttention-Add", "class_name": "Add", "config": {"name": "Decoder-1-MultiHeadQueryAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Decoder-1-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Decoder-1-MultiHeadQueryAttention-Dropout", 0, 0, {}]]]}, {"name": "Decoder-1-MultiHeadQueryAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Decoder-1-MultiHeadQueryAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "inbound_nodes": [[["Decoder-1-MultiHeadQueryAttention-Add", 0, 0, {}]]]}, {"name": "Decoder-1-FeedForward", "class_name": "FeedForward", "config": {"name": "Decoder-1-FeedForward", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "inbound_nodes": [[["Decoder-1-MultiHeadQueryAttention-Norm", 0, 0, {}]]]}, {"name": "Decoder-1-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Decoder-1-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Decoder-1-FeedForward", 0, 0, {}]]]}, {"name": "Decoder-1-FeedForward-Add", "class_name": "Add", "config": {"name": "Decoder-1-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Decoder-1-MultiHeadQueryAttention-Norm", 0, 0, {}], ["Decoder-1-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Decoder-1-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Decoder-1-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "inbound_nodes": [[["Decoder-1-FeedForward-Add", 0, 0, {}]]]}, {"name": "Decoder-2-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Decoder-2-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "head_num": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": true}, "inbound_nodes": [[["Decoder-1-FeedForward-Norm", 0, 0, {}]]]}, {"name": "Decoder-2-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Decoder-2-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Decoder-2-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Decoder-2-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Decoder-2-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Decoder-1-FeedForward-Norm", 0, 0, {}], ["Decoder-2-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Decoder-2-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Decoder-2-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "inbound_nodes": [[["Decoder-2-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Decoder-2-MultiHeadQueryAttention", "class_name": "MultiHeadAttention", "config": {"name": "Decoder-2-MultiHeadQueryAttention", "trainable": true, "dtype": "float32", "head_num": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "history_only": false}, "inbound_nodes": [[["Decoder-2-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Encoder-2-FeedForward-Norm", 0, 0, {}], ["Encoder-2-FeedForward-Norm", 0, 0, {}]]]}, {"name": "Decoder-2-MultiHeadQueryAttention-Dropout", "class_name": "Dropout", "config": {"name": "Decoder-2-MultiHeadQueryAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Decoder-2-MultiHeadQueryAttention", 0, 0, {}]]]}, {"name": "Decoder-2-MultiHeadQueryAttention-Add", "class_name": "Add", "config": {"name": "Decoder-2-MultiHeadQueryAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Decoder-2-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Decoder-2-MultiHeadQueryAttention-Dropout", 0, 0, {}]]]}, {"name": "Decoder-2-MultiHeadQueryAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Decoder-2-MultiHeadQueryAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "inbound_nodes": [[["Decoder-2-MultiHeadQueryAttention-Add", 0, 0, {}]]]}, {"name": "Decoder-2-FeedForward", "class_name": "FeedForward", "config": {"name": "Decoder-2-FeedForward", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dropout_rate": 0.0}, "inbound_nodes": [[["Decoder-2-MultiHeadQueryAttention-Norm", 0, 0, {}]]]}, {"name": "Decoder-2-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Decoder-2-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Decoder-2-FeedForward", 0, 0, {}]]]}, {"name": "Decoder-2-FeedForward-Add", "class_name": "Add", "config": {"name": "Decoder-2-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Decoder-2-MultiHeadQueryAttention-Norm", 0, 0, {}], ["Decoder-2-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Decoder-2-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Decoder-2-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 9.999999999999998e-15, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_constraint": null}, "inbound_nodes": [[["Decoder-2-FeedForward-Add", 0, 0, {}]]]}, {"name": "Output", "class_name": "EmbeddingSim", "config": {"name": "Output", "trainable": true, "dtype": "float32", "use_bias": true, "initializer": {"class_name": "Zeros", "config": {}}, "regularizer": null, "constraint": null, "stop_gradient": false}, "inbound_nodes": [[["Decoder-2-FeedForward-Norm", 0, 0, {}], ["Decoder-Token-Embedding", 0, 1, {}]]]}], "input_layers": [["Encoder-Input", 0, 0], ["Decoder-Input", 0, 0]], "output_layers": [["Output", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}